package a00_알고리즘기초;

public class A_00_체크리스트 {
/*								개념정리	기본문제	심화문제
	1. 자료구조	PQ				완료					
				트리				완료
				완전이진트리
				인덱스트리						
	2.정렬		정렬API								
	   	 		합병(MERGE)정렬						
	3. 그래프  	BFS				완료					
				DFS				완료					
				다익스트라			완료		완료			
				벨만포드			완료		완료			
				플로이드워셜		완료		완료			
				유니온파인드
				크루스칼(MST)
				위상정렬
				LCA								
				단절선								
				단절점								 								
	4. 수학		순열									
				조합									
				유클리드호제법		완료					
				에라토스테네스의 체						
	5. 기법		이진탐색			완료					
	 			파라메트릭 탐색							
	 			해싱			
	 			투포인트			완료		완료						
*/
}
