package b1_2_자료구조_트리;

public class A_트리_기본개념 {
	/*
	 * [트리(Tree)]
	 *  - 그래프의 일종
	 *  - 특수한 조건을 만족하는 그래프
	 *  - 용어
	 *   . 루트 노드(root): 부모 노드가 없는 트리의 최상위 노드
	 *   . 부모 노드: 자신보다 상위에 있는 노드
	 *   . 자식 노드: 자신보다 하위에 있는 노드
	 *   . 단말 노드(leaf): 자식이 없는 최하위 노드
	 *   . 형재 노드: 같은 부모를 갖는 노드
	 *   . 조상 노드: 해당 노드에서 루트 노느까지 가는 경로에 있는 모든 노드
	 *   . 자손 노드: 자신의 자식 노드와 그 자식 노드들
	 *   . 깊이: 루트 노드에서 해당 노드까지의 거리
	 *   . 높이: 트리에서 가장 깊이 있는 노드의 깊이
	 *  - 그래프와의 차이점, 트리의 특징
	 *   . 루트 노드 존재
	 *   . 사이클 존재X
	 *   . 어떤 정점에서 다른 저점으로 가는 경로가 유일함
	 *   . 정점의 수를 V라 하면 간선의 수는 V-1
	 *   . 루트 노드를 제외한 모든 노드의 입력 차수(in-degree)는 1
	 *   . 트리는 재귀적 속성을 가짐  
	 */
	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
