package b2_2_정렬_합병정렬;

public class A_정렬_합병정렬 {
	/*
	 * [합병정렬(Merge Sort)]
	 *  - Stable한 정렬로서 널리 알려진 정렬
	 *   ※ Stable Sort: 동일한 값이 있는 경우 순서 바뀌지 않음
	 *  - 비교하는 값이 같을 경우 원래의 순서가 유지되는 것을 보장하는 Stable 정렬
	 *  - Part: 구역을 둘로 분리
	 *  - Merge: 두 구역을 정렬하며 하나로 합침
	 *  - 시간복잡도: O(NlogN)
	 *  - 절차
	 *  1. 리스트의 길이가 0 또는 1이면 이미 정렬된 것으로 본다. 
	 *  2. 그렇지 않은 경우에는 정렬되지 않은 리스트를 절반으로 잘라 비슷한 크기의 두 부분 리스트로 나눈다.
	 *  3. 각 부분 리스트를 재귀적으로 합병 정렬을 이용해 정렬한다.
	 *  4. 두 부분 리스트를 다시 하나의 정렬된 리스트로 합병한다.
	 */
	public static void main(String[] args) {
		

	}

}
